GD FAQ v0.3, build date: 19.04.2015.
~ Мод-тян
 
#A: Когда конкурс?
Q: Скоро.
 
#A: За что могут предать анафеме?
Q: Кирилл Кириллыч, толстый троллинг, мусорные треды и беспричинное неймфажество очень не поощряются.
 
#A: Где мои треды?
Q: https://2ch.hk/gd/res/165410.html (Unity3D)
   https://2ch.hk/gd/res/157865.html (Unreal Engine)
   https://2ch.hk/gd/res/139328.html (Flash)
   https://2ch.hk/gd/res/141146.html (OpenGL)
   https://2ch.hk/gd/res/129788.html (DirectX)
   https://2ch.hk/gd/res/98064.html  (SDL)
   https://2ch.hk/gd/res/165824.html (Пикселетред)
   https://2ch.hk/gd/res/168904.html (Субшота)
   
#A: А прошлые прикрепленные?
Q: https://arhivach.org/thread/52895/
   https://arhivach.org/thread/64452/
   https://arhivach.org/thread/77591/
 
#A: Я полный ньюфаг, хочу по-быстрому сделать игру, что делать?
Q: Способ №1 (быстрый):
   1) Устанавливаешь: http://store.steampowered.com/app/214850/
   2) Ищешь уроки в гугле, туториалы есть даже в самом стиме, базовый нубонабор:
      http://steamcommunity.com/app/214850/guides/
      http://gmakers.ru/index.php?topic=4.0
      http://gamemakertutorials.com/?p=383
         
   Способ №2 (чуть подольше):
   1) Устанавливаешь: http://unity3d.com/ru/get-unity/download
   2) То же самое - ищешь уроки, расставляешь ассеты.
      http://unity3d.com/ru/learn/tutorials/
      http://habrahabr.ru/post/141362/
      http://habrahabr.ru/sandbox/68340/
         
#A: А какой движок/конструктор лучше?
Q: Идеального движка не существует. Есть лидеры рынка - Unreal Engine, CryEngine, Shiva3D, LeadWerks - которые обладают богатым функционалом, прямо "из коробки" позволяя использовать всё богатство современной графики и спец.фэффектов, при этом являясь дорогими и сложными для изучения. Есть и недорогой (а то и вовсе бесплатный) инструментарий для начинающих - Love2D, Game Maker, Construct, Project Anarchy - который является не самыми богатыми в плане возможностей, но при этом он лёгок для изучения новичкам. Еще есть Unity3D, о нем слышали все. Короче, гуглишь эти названия и соотносишь свои планы и возможности выбранного инструмента.
 
#A: Хочу собрать команду/найти художника-программиста-музыканта.
Q: Пиши в прикрепленном, если соберется критическое количество желающих - сделаем отдельный тред.
 
#A: Какой движок/рисовалка лучше для создания изометрии?
Q: Любой, поддерживающий отображение двумерной графики. Технически, изометрия ничем не отличается от какой-нибудь диметрии.
 
#A: Существуют ли конструкторы визуальных новелл?
Q: RenPy.
 
#A: Существуют ли конструкторы 2D RPG?
Q: RPGMaker.
 
#A: Существуют ли конструкторы текстовых игр?
Q: 1) Quest (http://textadventures.co.uk)
   2) Gargoyle (http://ccxvii.net/gargoyle/)
 
#A: Где можно глянуть всякие полезные математические формулы?
Q:  1) http://www.redblobgames.com/
    2) http://www.love2d.org/wiki/General_math
 
#A: Когда там уже будет мой первый миллион?
Q: Как только получишь наследство своего богатенького отца.
 
#А: Этот FAQ сосёт.
Q: Предложи своё решение проблемы.
 
#А: Почему модер такой хуй?
Q: EBIN x----D
